ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_timer.c
/******************************************************************//**
* @file		stm32f4_discovery_timer.c
* @brief	This file contains implementation of STM32F4 timers in custom method.
* @version	V1.0
* @date		May 20, 2015
* @author	Dwijay.Edutech Learning Solutions
**********************************************************************/


/* Includes ------------------------------------------------------------------- */
#include "stm32f4_discovery_timer.h"

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_TIMER
 * @{
 */

/* Public Types --------------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_TIMER_Public_Types
 * @{
 */
TIM_HandleTypeDef htim1_mcpwm;
TIM_HandleTypeDef htim8_mcpwm;

TIM_HandleTypeDef htim2_gen;
TIM_HandleTypeDef htim3_gen;
TIM_HandleTypeDef htim4_gen;
TIM_HandleTypeDef htim5_gen;

TIM_HandleTypeDef htim6_basic;
TIM_HandleTypeDef htim7_basic;

TIM_HandleTypeDef htim10_cap;
TIM_HandleTypeDef htim11_cap;
TIM_HandleTypeDef htim13_cap;
TIM_HandleTypeDef htim14_cap;

TIM_HandleTypeDef htim9_pcap;
TIM_HandleTypeDef htim12_pcap;
/**
 * @} STM32F4_DISCOVERY_TIMER_Public_Types End
 */


/* Private Functions ----------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_TIMER_Private_Functions
 * @{
 */

/**
 * @brief This function is used to configure timer hardware pins
 * @param htim_base   Select Timer handler
 * @param tim_ch      Select Timer channel
 */
static void BSP_TIM_Base_MspInit(TIM_HandleTypeDef* htim_base, TIM_CH_Type tim_ch)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  if(htim_base->Instance==TIM1)
  {
    /* Peripheral clock enable */
    __TIM1_CLK_ENABLE();

    if(tim_ch != None)
    {
      /**TIM1 GPIO Configuration
      PE9     ------> TIM1_CH1
      PA7     ------> TIM1_CH1N
      PE11    ------> TIM1_CH2
      PB0     ------> TIM1_CH2N
      PE13    ------> TIM1_CH3
      PB1     ------> TIM1_CH3N
      */
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
      GPIO_InitStruct.Alternate = GPIO_AF1_TIM1;

      if(tim_ch == TIM_CH1)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_7;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_9;
        HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH2)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_0;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_11;
        HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH3)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_1;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_13;
        HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
      }
    }

    /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(TIM1_TRG_COM_TIM11_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM1_TRG_COM_TIM11_IRQn);
    HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);
    HAL_NVIC_SetPriority(TIM1_BRK_TIM9_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM1_BRK_TIM9_IRQn);
  }
  else if(htim_base->Instance==TIM2)
  {
    /* Peripheral clock enable */
    __TIM2_CLK_ENABLE();

    if(tim_ch != None)
    {
      /**TIM2 GPIO Configuration
      PA5     ------> TIM2_CH1
      PB10     ------> TIM2_CH3
      PB11     ------> TIM2_CH4
      PB3     ------> TIM2_CH2
      */
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
      GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;

      if(tim_ch == TIM_CH1)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_5;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH2)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_3;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH3)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_10;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH4)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_11;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
      }
    }

    /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
  }
  else if(htim_base->Instance==TIM3)
  {
    /* Peripheral clock enable */
    __TIM3_CLK_ENABLE();

    if(tim_ch != None)
    {
      /**TIM3 GPIO Configuration
      PA6     ------> TIM3_CH1
      PA7     ------> TIM3_CH2
      PB0     ------> TIM3_CH3
      PB1     ------> TIM3_CH4
      */
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
      GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;

      if(tim_ch == TIM_CH1)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_6;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH2)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_7;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH3)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_0;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
      }
      else if(tim_ch == TIM_CH4)
      {
        GPIO_InitStruct.Pin = GPIO_PIN_1;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
      }
    }

    /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(TIM3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM3_IRQn);
  }
  else if(htim_base->Instance==TIM4)
  {
    /* Peripheral clock enable */
    __TIM4_CLK_ENABLE();

    if(tim_ch != None)
    {
      /**TIM4 GPIO Configuration
      PD12     ------> TIM4_CH1
      PD13     ------> TIM4_CH2
      PD14     ------> TIM4_CH3
      PD15     ------> TIM4_CH4
      */
      if(tim_ch == TIM_CH1)
        GPIO_InitStruct.Pin = GPIO_PIN_12;
      else if(tim_ch == TIM_CH2)
        GPIO_InitStruct.Pin = GPIO_PIN_13;
      else if(tim_ch == TIM_CH3)
        GPIO_InitStruct.Pin = GPIO_PIN_14;
      else if(tim_ch == TIM_CH4)
        GPIO_InitStruct.Pin = GPIO_PIN_15;

      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
      GPIO_InitStruct.Alternate = GPIO_AF2_TIM4;
      HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
    }

    /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(TIM4_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM4_IRQn);
  }
  else if(htim_base->Instance==TIM5)
  {
    /* Peripheral clock enable */
    __TIM5_CLK_ENABLE();

