ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_timer.c
  if(htim_base == &htim6_basic)
    htim_base->Instance = TIM6;
  else if(htim_base == &htim7_basic)
    htim_base->Instance = TIM7;

  htim_base->Init.CounterMode = TIM_COUNTERMODE_UP;

  if(1000 <= period_us <= 1000000) // 1Hz to 1KHz
  {
    htim_base->Init.Prescaler = SystemCoreClock/132000;
    htim_base->Init.Period = (float)(65000/(1000000/period_us));
  }
  else if(5 <= period_us < 1000) //1KHz to 200KHz
  {
    htim_base->Init.Prescaler = SystemCoreClock/168000000;
    htim_base->Init.Period = (float)(41900000/(1000000/period_us));
  }
  else if(0.5 <= period_us < 5) //200KHz to 2MHz
  {
    htim_base->Init.Prescaler = 0;
    htim_base->Init.Period = (float)(83800000/(1000000/period_us));
  }

  BSP_TIM_Base_MspInit(htim_base, None);
  HAL_TIM_Base_Init(htim_base);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(htim_base, &sMasterConfig);
}


/**
 * @brief General Purpose Timers for frequency generation and time keeping
 * @param htim_base   Timer Handlers
 *        @arg  htim2_gen  All uses interrupt
 *        @arg  htim3_gen
 *        @arg  htim4_gen
 *        @arg  htim5_gen
 * @param tim_ch      Select Hardware channel or use without channel
 *        @arg  None      No channel        TIM2    TIM3    TIM4    TIM5
 *                                          ----------------------------
 *        @arg  TIM_CH1   Timer Channel 1   PA5     PA6     PD12    PA0
 *        @arg  TIM_CH2   Timer Channel 2   PB3     PA7     PD13    PA1
 *        @arg  TIM_CH3   Timer Channel 3   PB10    PB0     PD14    PA2
 *        @arg  TIM_CH4   Timer Channel 4   PB11    PB1     PD15    PA3
 * @param freq_hz     Frequency in Hz (range: 1Hz to 2MHz)
 * @param hw_toggle   Hardware Pin behavior on Match
 *        @arg  TIM_OC_MODE_NOTHING   User Pin
 *        @arg  TIM_OC_MODE_TOGGLE    Toggle on Match
 *        @arg  TIM_OC_MODE_LOW       Low on Match
 *        @arg  TIM_OC_MODE_HIGH      High on Match
 * @return  None
 */
void BSP_TIM_Config(TIM_HandleTypeDef* htim_base, TIM_CH_Type tim_ch, uint32_t freq_hz, TIM_OC_MODE_OPT hw_toggle)
{
  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_OC_InitTypeDef sConfigOC;

  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();
  __GPIOD_CLK_ENABLE();

  if(htim_base == &htim2_gen)
    htim_base->Instance = TIM2;
  else if(htim_base == &htim3_gen)
    htim_base->Instance = TIM3;
  else if(htim_base == &htim4_gen)
    htim_base->Instance = TIM4;
  else if(htim_base == &htim5_gen)
    htim_base->Instance = TIM5;

  if(freq_hz <= 1000) // 1HZ to 1KHZ
  {
    htim_base->Init.Prescaler = SystemCoreClock/132000;
    htim_base->Init.Period = 65000/2*freq_hz;
  }
  else if (freq_hz <=200000) //1KHZ to 200 KHZ
  {
    htim_base->Init.Prescaler = SystemCoreClock/168000000;
    htim_base->Init.Period = 41900000/2*freq_hz;
  }
  else if (freq_hz <= 2000000) //200KHZ to 2MHz
  {
    htim_base->Init.Prescaler = 0;
    htim_base->Init.Period = 83800000/2*freq_hz;
  }

  htim_base->Init.CounterMode = TIM_COUNTERMODE_UP;
  htim_base->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;

  BSP_TIM_Base_MspInit(htim_base, tim_ch);
  HAL_TIM_Base_Init(htim_base);

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(htim_base, &sClockSourceConfig);

  HAL_TIM_OC_Init(htim_base);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(htim_base, &sMasterConfig);

  if(hw_toggle == TIM_OC_MODE_NOTHING)
    sConfigOC.OCMode = TIM_OCMODE_TIMING;
  else if(hw_toggle == TIM_OC_MODE_LOW)
    sConfigOC.OCMode = TIM_OCMODE_INACTIVE;
  else if(hw_toggle == TIM_OC_MODE_HIGH)
    sConfigOC.OCMode = TIM_OCMODE_ACTIVE;
  if(hw_toggle == TIM_OC_MODE_TOGGLE)
    sConfigOC.OCMode = TIM_OCMODE_TOGGLE;

  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

  if(tim_ch == TIM_CH1)
    HAL_TIM_OC_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_1);
  else if(tim_ch == TIM_CH2)
    HAL_TIM_OC_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_2);
  else if(tim_ch == TIM_CH3)
    HAL_TIM_OC_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_3);
  else if(tim_ch == TIM_CH4)
    HAL_TIM_OC_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_4);
}


/**
 * @brief General Purpose PWM Timer Configurations
 * @param htim_base     Timer Handlers
 *        @arg  htim2_gen  All uses interrupt
 *        @arg  htim3_gen
 *        @arg  htim4_gen
 *        @arg  htim5_gen
 * @param tim_ch        Select Hardware channel or use without channel
 *        @arg  None      No channel        TIM2    TIM3    TIM4    TIM5
 *                                          ----------------------------
 *        @arg  TIM_CH1   Timer Channel 1   PA5     PA6     PD12    PA0
 *        @arg  TIM_CH2   Timer Channel 2   PB3     PA7     PD13    PA1
 *        @arg  TIM_CH3   Timer Channel 3   PB10    PB0     PD14    PA2
 *        @arg  TIM_CH4   Timer Channel 4   PB11    PB1     PD15    PA3
 * @param freq_hz       Frequency in Hz (range: 1Hz to 2MHz)
 * @param pulsewidth_us Provide Pulse width value in microseconds for respective frequency
 * @param pwm_mode      Select PWM mode
 *        @arg  PWM_EDGE_ALIGN_MODE     Default Mode to Select
 *        @arg  PWM_CENTER_ALIGN_MODE1  <Provide Desc>
 *        @arg  PWM_CENTER_ALIGN_MODE2  <Provide Desc>
 *        @arg  PWM_CENTER_ALIGN_MODE3  <Provide Desc>
 * @return  None
 */
void BSP_PWM_Config(TIM_HandleTypeDef* htim_base, TIM_CH_Type tim_ch, uint32_t freq_hz, float pulsewidth_us, PWM_ALIGN_MODE pwm_mode)
{
  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_OC_InitTypeDef sConfigOC;

  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();
  __GPIOD_CLK_ENABLE();

  if(htim_base == &htim2_gen)
    htim_base->Instance = TIM2;
  else if(htim_base == &htim3_gen)
    htim_base->Instance = TIM3;
  else if(htim_base == &htim4_gen)
    htim_base->Instance = TIM4;
  else if(htim_base == &htim5_gen)
    htim_base->Instance = TIM5;

  if(freq_hz <= 1000) // 1HZ to 1KHZ
  {
    htim_base->Init.Prescaler = SystemCoreClock/132000;

    if(pwm_mode == PWM_EDGE_ALIGN_MODE)
      htim_base->Init.Period = 65000/2*freq_hz;
    else
      htim_base->Init.Period = 65000/freq_hz;
  }
  else if (freq_hz <=200000) //1KHZ to 200000 KHZ
  {
    htim_base->Init.Prescaler = SystemCoreClock/168000000;

    if(pwm_mode == PWM_EDGE_ALIGN_MODE)
      htim_base->Init.Period = 41900000/2*freq_hz;
    else
      htim_base->Init.Period = 41900000/freq_hz;
  }
  else if (freq_hz <= 2000000) //200000KHZ to 2000000KHZ
  {
    htim_base->Init.Prescaler = 0;

    if(pwm_mode == PWM_EDGE_ALIGN_MODE)
      htim_base->Init.Period = 83800000/2*freq_hz;
    else
      htim_base->Init.Period = 83800000/freq_hz;
  }

  if(pwm_mode == PWM_EDGE_ALIGN_MODE)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_UP;
  else if(pwm_mode == PWM_CENTER_ALIGN_MODE1)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED1;
  else if(pwm_mode == PWM_CENTER_ALIGN_MODE2)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED2;
  else if(pwm_mode == PWM_CENTER_ALIGN_MODE3)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED3;

  htim_base->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;

  BSP_TIM_Base_MspInit(htim_base, tim_ch);
  HAL_TIM_Base_Init(htim_base);

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(htim_base, &sClockSourceConfig);

  HAL_TIM_PWM_Init(htim_base);

