ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_timer.c
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(htim_base, &sMasterConfig);

  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

  if(freq_hz <= 1000) // 1HZ to 1KHZ
    sConfigOC.Pulse = (float)(65000/(1000000/pulsewidth_us));
  else if (freq_hz <=200000) //1KHZ to 200000 KHZ
    sConfigOC.Pulse = (float)(41900000/(1000000/pulsewidth_us));
  else if (freq_hz <= 2000000) //200000KHZ to 2000000KHZ
    sConfigOC.Pulse = (float)(83800000/(1000000/pulsewidth_us));

  if(tim_ch == TIM_CH1)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_1);
  else if(tim_ch == TIM_CH2)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_2);
  else if(tim_ch == TIM_CH3)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_3);
  else if(tim_ch == TIM_CH4)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_4);
}


/**
 * @brief This is Motor Control PWM Timer Configuration function
 * @param htim_base     Timer Handler
 *        @arg  htim1_mcpwm
 *        @arg  htim2_mcpwm
 * @param tim_ch        Select Hardware channel or use without channel
 *        @arg  None      No channel            TIM1     |    TIM8
 *                                          -------------|-------------
 *        @arg  TIM_CH1   Timer Channel 1   PE9    PA7(N)| PC6   PA5 (N)
 *        @arg  TIM_CH2   Timer Channel 2   PE11   PB0(N)| PC7   PB14(N)
 *        @arg  TIM_CH3   Timer Channel 3   PE13   PB1(N)| PC8   PB15(N)
 * @param freq_hz       Frequency in Hz (range: 1Hz to 2MHz)
 * @param pulsewidth_us Provide Pulse width value in microseconds for respective frequency
 * @param deadtime      Provide deadtime (Range: 0 to 255)
 * @param pwm_mode      Select PWM mode
 *        @arg  PWM_EDGE_ALIGN_MODE     Default Mode to Select
 *        @arg  PWM_CENTER_ALIGN_MODE1  <Provide Desc>
 *        @arg  PWM_CENTER_ALIGN_MODE2  <Provide Desc>
 *        @arg  PWM_CENTER_ALIGN_MODE3  <Provide Desc>
 * @return  None
 */
void BSP_MCPWM_Config(TIM_HandleTypeDef* htim_base, TIM_CH_Type tim_ch, uint32_t freq_hz, float pulsewidth_us, uint8_t deadtime, PWM_ALIGN_MODE pwm_mode)
{
  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig;
  TIM_OC_InitTypeDef sConfigOC;

  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();
  __GPIOC_CLK_ENABLE();
  __GPIOE_CLK_ENABLE();

  if(htim_base == &htim1_mcpwm)
    htim_base->Instance = TIM1;
  else if(htim_base == &htim8_mcpwm)
    htim_base->Instance = TIM8;

  if(freq_hz <= 1000) // 1HZ to 1KHZ
  {
    htim_base->Init.Prescaler = SystemCoreClock/132000;

    if(pwm_mode == PWM_EDGE_ALIGN_MODE)
      htim_base->Init.Period = 65000/2*freq_hz;
    else
      htim_base->Init.Period = 65000/freq_hz;
  }
  else if (freq_hz <=200000) //1KHZ to 200000 KHZ
  {
    htim_base->Init.Prescaler = SystemCoreClock/168000000;

    if(pwm_mode == PWM_EDGE_ALIGN_MODE)
      htim_base->Init.Period = 41900000/2*freq_hz;
    else
      htim_base->Init.Period = 41900000/freq_hz;
  }
  else if (freq_hz <= 2000000) //200000KHZ to 2000000KHZ
  {
    htim_base->Init.Prescaler = 0;

    if(pwm_mode == PWM_EDGE_ALIGN_MODE)
      htim_base->Init.Period = 83800000/2*freq_hz;
    else
      htim_base->Init.Period = 83800000/freq_hz;
  }

  if(pwm_mode == PWM_EDGE_ALIGN_MODE)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_UP;
  else if(pwm_mode == PWM_CENTER_ALIGN_MODE1)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED1;
  else if(pwm_mode == PWM_CENTER_ALIGN_MODE2)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED2;
  else if(pwm_mode == PWM_CENTER_ALIGN_MODE3)
    htim_base->Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED3;

  htim_base->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim_base->Init.RepetitionCounter = 0;

  BSP_TIM_Base_MspInit(htim_base, tim_ch);
  HAL_TIM_Base_Init(htim_base);

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(htim_base, &sClockSourceConfig);

  HAL_TIM_PWM_Init(htim_base);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(htim_base, &sMasterConfig);

  sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
  sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
  sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
  sBreakDeadTimeConfig.DeadTime = deadtime;
  sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
  sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
  sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
  HAL_TIMEx_ConfigBreakDeadTime(htim_base, &sBreakDeadTimeConfig);

  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;

  if(freq_hz <= 1000) // 1HZ to 1KHZ
    sConfigOC.Pulse = (float)(65000/(1000000/pulsewidth_us));
  else if (freq_hz <=200000) //1KHZ to 200000 KHZ
    sConfigOC.Pulse = (float)(41900000/(1000000/pulsewidth_us));
  else if (freq_hz <= 2000000) //200000KHZ to 2000000KHZ
    sConfigOC.Pulse = (float)(83800000/(1000000/pulsewidth_us));

  if(tim_ch == TIM_CH1)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_1);
  else if(tim_ch == TIM_CH2)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_2);
  else if(tim_ch == TIM_CH3)
    HAL_TIM_PWM_ConfigChannel(htim_base, &sConfigOC, TIM_CHANNEL_3);
}


/**
 * @brief This is Timer Capture configuration function
 *        Capture Channel Pins
 *        TIM10   PB8
 *        TIM11   PB9
 *        TIM13   PA6
 *        TIM14   PA7
 * @param htim_base   Timer Handler
 *        @arg  htim10_cap
 *        @arg  htim11_cap
 *        @arg  htim13_cap
 *        @arg  htim14_cap
 * @param capFreq_hz  <provide description>
 * @return  None
 */
void BSP_TIM_Capture_Config(TIM_HandleTypeDef* htim_base, uint32_t capFreq_hz)
{
  TIM_IC_InitTypeDef sConfigIC;

  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();

  if(htim_base == &htim10_cap)
    htim_base->Instance = TIM10;
  else if(htim_base == &htim11_cap)
    htim_base->Instance = TIM11;
  else if(htim_base == &htim13_cap)
    htim_base->Instance = TIM13;
  else if(htim_base == &htim14_cap)
    htim_base->Instance = TIM14;

  htim_base->Init.Prescaler = (SystemCoreClock)/168000000;
  htim_base->Init.Period = 168000000/capFreq_hz;

  htim_base->Init.CounterMode = TIM_COUNTERMODE_UP;
  htim_base->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;

  BSP_TIM_Base_MspInit(htim_base, None);
  HAL_TIM_Base_Init(htim_base);

  HAL_TIM_IC_Init(htim_base);

